#!/usr/bin/python
# -*- coding: UTF-8 -*-
''' Statistics'''
#describe、mean、corr、count、max、min、median、std
import pandas as pd
import numpy as np
#describe 属性函数对于数据的快速统计汇总
dates=pd.date_range('20170729',periods=6)
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))
print '输出原函数DF\n',df
'''
输出原函数DF
                   A         B         C         D
2017-07-29 -1.867461 -0.629705 -0.224561 -1.307286
2017-07-30  0.521533 -1.525242  1.014620 -1.340592
2017-07-31 -0.559092  0.408870 -1.486933 -0.079068
2017-08-01  0.019914 -0.526611  0.700738  0.650659
2017-08-02 -1.169290  0.048942 -0.169592 -0.812483
2017-08-03  1.848018  2.078886 -0.588262  0.041515
'''
print '对DF所有直范围快速统计汇总\n',df.describe()
'''
              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.310145 -0.237714 -0.128539  0.002228
std    1.343568  1.469869  1.093882  0.939242
min   -1.895521 -1.432314 -1.732306 -0.715095
25%   -0.909736 -1.394960 -0.724097 -0.611860
50%   -0.489711 -0.866072 -0.113593 -0.492311
75%   -0.160747  0.859997  0.613942  0.508903
max    2.114909  1.874075  1.259402  1.522154
'''
#mean 属性对df所有值返回mean
print '对DF返回mean\n',df.mean()
'''
对DF返回mean
A   -0.553900
B   -0.005410
C   -0.036524
D   -0.421863
'''
#corr 属性对df所有值返回相关系数值
print '对DF返回corr相关系数\n',df.corr()
'''
对DF返回corr相关系数
          A         B         C         D
A  1.000000  0.556117  0.446018  0.059050
B  0.556117  1.000000  0.462006  0.504796
C  0.446018  0.462006  1.000000  0.094468
D  0.059050  0.504796  0.094468  1.000000
'''
#count 属性对df计数，可对列或者行，通过axis。行进行计数
print '对DF计数\n',df.count(axis=1)
'''
对DF计数
2017-07-29    4
2017-07-30    4
2017-07-31    4
2017-08-01    4
2017-08-02    4
2017-08-03    4
'''

